Revit 2027 API
BuiltInFailures.RebarFailures.OutOfPlaneBendDiameterTooSmall Property
 The Out of Plane Bend Diameter for Rebar Shape XX is too small for Rebar Bar Type YY.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OutOfPlaneBendDiameterTooSmall { get; }
Public Shared ReadOnly Property OutOfPlaneBendDiameterTooSmall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OutOfPlaneBendDiameterTooSmall {
	FailureDefinitionId^ get ();
}
static member OutOfPlaneBendDiameterTooSmall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace